-- 正在导出表  inkwash.cms_article 的数据：~12 rows (大约)
INSERT INTO `cms_article` (`id`, `title`, `slug`, `summary`, `cover_url`, `content`, `content_type`, `author_id`, `category_id`, `status`, `reviewer_id`, `opinion`, `view_count`, `comment_count`, `agree_count`, `favorite_count`, `share_count`, `averse_count`, `publish_time`, `creator`, `create_time`, `updater`, `update_time`) VALUES
	(1, '论语', '论语', '儒家学派的经典著作之一，由孔子的弟子及其再传弟子编撰而成', '', '子曰：“学而时习之，不亦说乎？有朋自远方来，不亦乐乎？人不知而不愠，不亦君子乎？”\n\n子曰：“吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不逾矩。”\n子曰：“温故而知新，可以为师矣。”\n子曰：“学而不思则罔，思而不学则殆。”\n子曰：“由，诲女知之乎！知之为知之，不知为不知，是知也。”\n\n子曰：“见贤思齐焉，见不贤而内自省也。”\n\n子贡问曰：“孔文子何以谓之文也？”子曰：“敏而好学，不耻下问，是以谓之文也。”\n\n子曰：“知之者不如好之者，好之者不如乐之者。”\n子曰：“知者乐水，仁者乐山。知者动，仁者静。知者乐，仁者寿。”\n\n子曰：“默而识之，学而不厌，诲人不倦，何有于我哉？”\n子曰：“三人行，必有我师焉。择其善者而从之，其不善者而改之。”\n\n子曰：“三军可夺帅也，匹夫不可夺志也。”\n\n颜渊问仁，子曰：“克己复礼为仁。一日克己复礼，天下归仁焉。为仁由己，而由人乎哉？”颜渊曰：“请问其目？”子曰：“非礼勿视，非礼勿听，非礼勿言，非礼勿动。”颜渊曰：“回虽不敏，请事斯语矣。”\n\n子曰：“君子和而不同，小人同而不和。”\n子曰：“君子泰而不骄，小人骄而不泰。”\n\n或曰：“以德报怨，何如？”子曰：“何以报德？以直报怨，以德报德。”\n\n子贡问曰：“有一言而可以终身行之者乎？”子曰：“其恕乎！己所不欲，勿施于人。”\n\n孔子曰：“不知命，无以为君子也；不知礼，无以立也；不知言，无以知人也。”', 'markdown', 3, 12, 5, 4, NULL, 2, 0, 0, 0, 0, 0, '2026-10-08 21:36:51', 3, '2026-10-08 20:02:20', 3, '2026-10-08 16:23:12'),
	(2, '得道多助,失道寡助', '得道多助失道寡助', '', '', '  天时不如地利，地利不如人和。三里之城，七里之郭，环而攻之而不胜。夫环而攻之，必有得天时者矣，然而不胜者，是天时不如地利也。城非不高也，池非不深也，兵革非不坚利也，米粟非不多也，委而去之，是地利不如人和也。\n  故曰：域民不以封疆之界，固国不以山溪之险，威天下不以兵革之利。得道者多助，失道者寡助。寡助之至，亲戚畔之；多助之至，天下顺之。以天下之所顺，攻亲戚之所畔，故君子有不战，战必胜矣。', 'markdown', 4, 12, 5, 3, NULL, 1, 0, 0, 0, 0, 0, '2026-10-08 21:43:08', 4, '2026-10-08 21:29:14', 4, '2026-10-08 14:30:05'),
	(3, '生于忧患,死于安乐', '生于忧患死于安乐', '', '', ' 舜发于畎亩之中，傅说举于版筑之间，胶鬲举于鱼盐之中，管夷吾举于士，孙叔敖举于海，百里奚举于市。故天将降大任于是人也，必先苦其心志，劳其筋骨，饿其体肤，空乏其身，行拂乱其所为，所以动心忍性，曾益其所不能。\n  人恒过，然后能改；困于心，衡于虑，而后作；征于色，发于声，而后喻。入则无法家拂士，出则无敌国外患者，国恒亡。然后知生于忧患而死于安乐也。', 'markdown', 4, 12, 5, 3, NULL, 2, 0, 0, 1, 0, 0, '2026-10-08 21:42:20', 4, '2026-10-08 21:30:50', 4, '2026-10-08 14:30:59'),
	(4, '鱼我所欲也', '鱼我所欲也', '', '', '鱼，我所欲也；熊掌，亦我所欲也。二者不可得兼，舍鱼而取熊掌者也。**生，亦我所欲也；义，亦我所欲也。二者不可得兼，舍生而取义者也**。生亦我所欲，所欲有甚于生者，故不为苟得也；死亦我所恶，所恶有甚于死者，故患有所不辟也。如使人之所欲莫甚于生，则凡可以得生者何不用也？使人之所恶莫甚于死者，则凡可以辟患者何不为也？由是则生而有不用也，由是则可以辟患而有不为也。是故所欲有甚于生者，所恶有甚于死者。非独贤者有是心也，人皆有之，贤者能勿丧耳。\n一箪食，一豆羹，得之则生，弗得则死。呼尔而与之，行道之人弗受；蹴尔而与之，乞人不屑也。万钟则不辩礼义而受之，万钟于我何加焉！为宫室之美、妻妾之奉、所识穷乏者得我与？乡为身死而不受，今为宫室之美为之；乡为身死而不受，今为妻妾之奉为之；乡为身死而不受，今为所识穷乏者得我而为之：是亦不可以已乎？此之谓失其本心。', 'markdown', 4, 12, 5, 3, NULL, 4, 1, 1, 0, 0, 0, '2026-10-08 21:42:17', 4, '2026-10-08 21:31:48', 4, '2026-10-08 14:30:44'),
	(5, '宣州谢朓楼饯别校书叔云', '宣州谢朓楼饯别校书叔云', '', '', '弃我去者，昨日之日不可留；\n乱我心者，今日之日多烦忧。\n长风万里送秋雁，对此可以酣高楼。\n蓬莱文章建安骨，中间小谢又清发。\n俱怀逸兴壮思飞，欲上青天揽明月。\n抽刀断水水更流，举杯消愁愁更愁。\n人生在世不称意，明朝散发弄扁舟。', 'markdown', 5, 10, 5, 3, NULL, 1, 0, 0, 0, 0, 0, '2026-10-08 22:43:28', 5, '2026-10-08 22:00:25', 5, '2026-10-08 14:47:54'),
	(6, '将进酒', '将进酒', '', '', '君不见黄河之水天上来，奔流到海不复回。\n君不见高堂明镜悲白发，朝如青丝暮成雪。\n人生得意须尽欢，莫使金樽空对月。\n**天生我材必有用，千金散尽还复来。**\n烹羊宰牛且为乐，会须一饮三百杯。\n岑夫子，丹丘生，将进酒，杯莫停。\n与君歌一曲，请君为我倾耳听。\n\n钟鼓馔玉不足贵，但愿长醉不愿醒。\n古来圣贤皆寂寞，惟有饮者留其名。\n陈王昔时宴平乐，斗酒十千恣欢谑。\n主人何为言少钱，径须沽取对君酌。\n五花马、千金裘，呼儿将出换美酒，\n与尔同销万古愁。', 'markdown', 5, 10, 5, 3, NULL, 2, 1, 1, 0, 0, 0, '2026-10-08 22:43:37', 5, '2026-10-08 22:01:45', 5, '2026-10-08 23:49:33'),
	(7, '行路难·其一', '行路难其一', '', '', '金樽清酒斗十千，玉盘珍羞直万钱。\n停杯投箸不能食，拔剑四顾心茫然。\n欲渡黄河冰塞川，将登太行雪满山。\n闲来垂钓碧溪上，忽复乘舟梦日边。\n行路难，行路难，多歧路，今安在？\n**长风破浪会有时，直挂云帆济沧海。**', 'markdown', 5, 10, 5, 3, NULL, 1, 0, 1, 0, 0, 0, '2026-10-08 22:44:25', 5, '2026-10-08 22:02:48', 5, '2026-10-08 23:50:56'),
	(8, '侠客行', '侠客行', '', '', '赵客缦胡缨，吴钩霜雪明。\n银鞍照白马，飒沓如流星。\n十步杀一人，千里不留行。\n事了拂衣去，深藏身与名。\n闲过信陵饮，脱剑膝前横。\n将炙啖朱亥，持觞劝侯嬴。\n三杯吐然诺，五岳倒为轻。\n眼花耳热后，意气素霓生。\n救赵挥金槌，邯郸先震惊。\n千秋二壮士，烜赫大梁城。\n纵死侠骨香，不惭世上英。\n谁能书阁下，白首太玄经。', 'markdown', 5, 10, 3, 3, NULL, 0, 0, 0, 0, 0, 0, NULL, 5, '2026-10-08 22:06:38', 5, '2026-10-08 22:44:12'),
	(9, '长相思·其一', '长相思其一', '', '', '长相思，在长安。\n络纬秋啼金井阑，微霜凄凄簟色寒。\n孤灯不明思欲绝，卷帷望月空长叹。\n\n美人如花隔云端。\n上有青冥之长天，下有渌水之波澜。\n天长路远魂飞苦，梦魂不到关山难。\n长相思，摧心肝。', 'markdown', 5, 10, 5, 3, NULL, 2, 0, 0, 1, 0, 0, '2026-10-08 22:44:22', 5, '2026-10-08 22:07:38', 5, '2026-10-08 23:50:47'),
	(10, '定风波', '定风波', '三月七日，沙湖道中遇雨。雨具先去，同行皆狼狈，余独不觉，已而遂晴，故作此词', '', '莫听穿林打叶声，何妨吟啸且徐行。\n竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。\n\n料峭春风吹酒醒，微冷，山头斜照却相迎。\n回首向来萧瑟处，归去，也无风雨也无晴。', 'markdown', 6, 11, 2, 3, NULL, 0, 0, 0, 0, 0, 0, NULL, 6, '2026-10-08 22:10:06', 6, '2026-10-08 16:23:43'),
	(11, '水调歌头·明月几时有', '水调歌头明月几时有', '丙辰中秋，欢饮达旦，大醉，作此篇，兼怀子由', '', '明月几时有？把酒问青天。\n不知天上宫阙，今夕是何年。\n我欲乘风归去，又恐琼楼玉宇，高处不胜寒。\n起舞弄清影，何似在人间？\n\n转朱阁，低绮户，照无眠。\n不应有恨，何事长向别时圆？\n人有悲欢离合，月有阴晴圆缺，此事古难全。\n但愿人长久，千里共婵娟。', 'markdown', 6, 11, 5, 4, NULL, 0, 0, 0, 0, 0, 0, '2026-10-09 08:29:35', 6, '2026-10-08 22:11:42', 6, '2026-10-09 08:29:35'),
	(12, '江城子·乙卯正月二十日夜记梦', '江城子乙卯正月二十日夜记梦', '', '', '十年生死两茫茫，不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，尘满面，鬓如霜。\n\n夜来幽梦忽还乡，小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，明月夜，短松冈。', 'markdown', 6, 11, 5, 3, NULL, 0, 0, 0, 0, 0, 0, '2026-10-09 08:29:32', 6, '2026-10-08 22:12:41', 6, '2026-10-09 08:29:32');

-- 正在导出表  inkwash.cms_article_term 的数据：~13 rows (大约)
INSERT INTO `cms_article_term` (`article_id`, `term_id`) VALUES
	(1, 5),
	(2, 5),
	(4, 5),
	(5, 1),
	(6, 1),
	(7, 1),
	(8, 1),
	(9, 2),
	(10, 1),
	(10, 5),
	(11, 6),
	(12, 2),
	(12, 6);

-- 正在导出表  inkwash.cms_category 的数据：~15 rows (大约)
INSERT INTO `cms_category` (`id`, `parent_id`, `name`, `slug`, `remark`, `level`, `status`, `creator`, `create_time`, `updater`, `update_time`) VALUES
	(1, NULL, '文章', 'essays', '', 0, 1, NULL, '2026-10-06 13:35:32', NULL, '2026-10-06 13:35:32'),
	(2, NULL, '小说', 'novels', '', 0, 1, NULL, '2026-10-06 13:36:35', NULL, '2026-10-06 13:36:35'),
	(3, NULL, '诗词', 'poems', '', 0, 1, NULL, '2026-10-06 13:36:58', NULL, '2026-10-06 13:36:58'),
	(4, NULL, '古文', 'classic', '', 0, 1, NULL, '2026-10-06 13:38:39', NULL, '2026-10-06 13:38:39'),
	(5, NULL, '百科', 'encycs', '', 0, 1, NULL, '2026-10-06 13:39:43', NULL, '2026-10-06 13:39:43'),
	(6, 1, '随笔', 'jottings', '', 1, 1, NULL, '2026-10-06 13:41:19', NULL, '2026-10-06 13:41:19'),
	(7, 1, '故事', 'story', '', 1, 1, NULL, '2026-10-06 13:42:17', NULL, '2026-10-06 13:42:17'),
	(8, 2, '神话', 'myth', '', 1, 1, NULL, '2026-10-06 13:44:46', NULL, '2026-10-06 13:44:46'),
	(9, 2, '传记', 'biogs', '', 1, 1, NULL, '2026-10-06 13:45:38', NULL, '2026-10-06 13:45:38'),
	(10, 3, '唐诗', 'poetry', '', 1, 1, NULL, '2026-10-06 13:46:02', NULL, '2026-10-06 13:46:02'),
	(11, 3, '宋词', 'lyrics', '', 1, 1, NULL, '2026-10-06 13:46:27', NULL, '2026-10-06 13:46:27'),
	(12, 4, '百家', 'sages', '', 1, 1, NULL, '2026-10-06 13:52:35', NULL, '2026-10-06 13:52:35'),
	(13, 4, '散文', 'prose', '', 1, 1, NULL, '2026-10-06 13:53:04', NULL, '2026-10-06 13:53:04'),
	(14, 5, '自然', 'nature', '', 1, 1, NULL, '2026-10-06 13:53:43', NULL, '2026-10-06 13:53:43'),
	(15, 5, '人文', 'humanism', '', 1, 1, NULL, '2026-10-06 13:56:17', NULL, '2026-10-06 13:56:17');

-- 正在导出表  inkwash.cms_comment 的数据：~0 rows (大约)
INSERT INTO `cms_comment` (`id`, `article_id`, `commenter_id`, `parent_id`, `content`, `agree_count`, `status`, `creator`, `create_time`, `updater`, `update_time`) VALUES
	(1, 4, 5, NULL, '道之所在，千万人吾往矣', 0, 1, NULL, '2026-10-08 22:30:34', NULL, '2026-10-08 14:30:33'),
	(2, 6, 6, NULL, '笔落惊风雨，诗成泣鬼神', 0, 1, NULL, '2026-10-08 22:47:35', NULL, '2026-10-08 14:47:34');

-- 正在导出表  inkwash.cms_interaction 的数据：~5 rows (大约)
INSERT INTO `cms_interaction` (`id`, `article_id`, `actor_id`, `agree`, `favorite`, `share`, `averse`, `create_time`) VALUES
	(1, 4, 5, 1, 0, 0, 0, '2026-10-08 22:30:14'),
	(2, 3, 5, 0, 1, 0, 0, '2026-10-08 22:31:00'),
	(3, 6, 6, 1, 0, 0, 0, '2026-10-08 22:46:05'),
	(4, 9, 6, 0, 1, 0, 0, '2026-10-08 22:48:04'),
	(5, 7, 6, 1, 0, 0, 0, '2026-10-09 07:50:57');

-- 正在导出表  inkwash.cms_sensitive 的数据：~0 rows (大约)
INSERT INTO `cms_sensitive` (`id`, `word`, `type`, `status`, `remark`, `creator`, `create_time`, `updater`, `update_time`) VALUES
	(1, 'fuck', 1, 1, '歪果仁常用的禁语', 2, '2026-10-08 11:29:03', 2, '2026-10-08 11:32:38'),
	(2, '皇军', 1, 1, '毫无人性的倭寇集团', 2, '2026-10-08 11:31:14', 2, '2026-10-08 11:31:14');

-- 正在导出表  inkwash.cms_term 的数据：~6 rows (大约)
INSERT INTO `cms_term` (`id`, `name`, `slug`, `status`, `remark`, `creator`, `create_time`, `updater`, `update_time`) VALUES
	(1, '豪放', 'forthright', 1, '', NULL, '2026-10-06 13:58:05', NULL, '2026-10-06 13:58:05'),
	(2, '婉约', 'graceful', 1, '', NULL, '2026-10-06 13:58:50', NULL, '2026-10-06 13:58:50'),
	(3, '边塞', '‌frontier', 1, '', NULL, '2026-10-06 13:59:33', NULL, '2026-10-06 13:59:33'),
	(4, '田园', 'pastoral', 1, '', NULL, '2026-10-06 14:00:09', NULL, '2026-10-06 14:00:09'),
	(5, '哲理', 'philosophy', 1, '', NULL, '2026-10-06 14:01:12', NULL, '2026-10-06 14:01:12'),
	(6, '抒情', 'lyricism', 1, '', NULL, '2026-10-06 14:01:50', NULL, '2026-10-06 14:01:50');

-- 正在导出表  inkwash.sys_account 的数据：~2 rows (大约)
-- Credential: bcrypt hash for 'Super99*'
INSERT INTO `sys_account` (`id`, `user_id`, `identity`, `auth_type`, `credential`, `status`, `expiration`, `login_time`, `create_time`, `update_time`) VALUES
	(3, 3, 'kongzi', 1, '{"passwordHash":"$2a$12$obLFyViK.9vd/9jRfA6io.sNRqhcBz2LwIWCuWAwqmdIqu6KURxQ2","type":1}', 1, NULL, '2026-10-08 22:33:04', NULL, NULL),
	(4, 4, 'mengzi', 1, '{"passwordHash":"$2a$12$I7bs/J9M2EHuJy3dunHPpeqJAbxljG2gTcAIuXiMOeoSuC7kudVJS","type":1}', 1, NULL, '2026-10-09 07:52:04', NULL, NULL),
	(5, 5, 'libai', 1, '{"passwordHash":"$2a$12$MFdT4aVLBvSQs..ZtVNe.u/5.sLyOmMpJRWGOO5VM3Kg9mOeh4VLe","type":1}', 1, NULL, '2026-10-08 22:28:07', NULL, NULL),
	(6, 6, 'sushi', 1, '{"passwordHash":"$2a$12$D9E7ZN/nB7uXukmIsE8pyOiSX8C/RQrSC7C6g02fHiPeoPr8bUSAm","type":1}', 1, NULL, '2026-10-09 07:49:57', NULL, NULL);

-- 正在导出表  inkwash.sys_identity 的数据：~2 rows (大约)
INSERT INTO `sys_identity` (`id`, `user_id`, `identity_type`, `identity_value`, `provider`, `verified`, `verified_at`, `verified_by`, `status`, `login_time`, `creator`, `updater`, `create_time`, `update_time`) VALUES
	(3, 3, 2, 'kongzi@ruilink.top', NULL, 1, '2026-10-08 19:35:10', 4, 1, NULL, NULL, NULL, '2026-10-08 19:35:10', '2026-10-08 19:35:10'),
	(4, 4, 2, 'mengzi@ruilink.top', NULL, 1, '2026-10-08 19:36:54', 4, 1, NULL, NULL, NULL, '2026-10-08 19:36:54', '2026-10-08 19:36:54'),
	(5, 5, 2, 'libai@ruilink.top', NULL, 1, '2026-10-08 19:40:13', 4, 1, NULL, NULL, NULL, '2026-10-08 19:40:13', '2026-10-08 19:40:13'),
	(6, 6, 2, 'sushi@ruilink.top', NULL, 1, '2026-10-08 19:42:38', 4, 1, NULL, NULL, NULL, '2026-10-08 19:42:38', '2026-10-08 19:42:38');

-- 正在导出表  inkwash.sys_user 的数据：~2 rows (大约)
INSERT INTO `sys_user` (`id`, `nickname`, `realname`, `gender`, `avatar`, `phone`, `email`, `idtype`, `idcode`, `motto`, `birthDate`, `status`, `education`, `location`, `biography`, `creator`, `updater`, `create_time`, `update_time`) VALUES
	(3, '孔子', '孔丘', 1, NULL, '', 'kongzi@ruilink.top', NULL, NULL, '己所不欲，勿施于人', NULL, 1, NULL, '370800', '孔子（公元前 551 年 9 月 28 日—前 479 年 4 月 11 日），名丘，字仲尼，春秋时期鲁国陬邑（今山东省曲阜市）人，中国古代思想家、政治家、教育家，儒家学派创始人。', 2, 2, '2026-10-08 19:35:09', '2026-10-08 19:35:09'),
	(4, '孟子', '孟轲', 1, NULL, '', 'mengzi@ruilink.top', NULL, NULL, '民为贵，社稷次之，君为轻', NULL, 1, NULL, '370800', '孟子（公元前372年-公元前289年），姬姓，孟氏，名轲，字子舆（待考，一说字子车、子居），与孔子并称“孔孟”，战国时期邹国（今山东邹城）人。是儒学集大成者、儒家学派的代表人物，中国古代思想家、哲学家、政治家、教育家。', 2, 2, '2026-10-08 19:36:53', '2026-10-08 19:36:53'),
	(5, '太白', '李白', 1, NULL, '', 'libai@ruilink.top', NULL, NULL, '天生我材必有用，千金散尽还复来', NULL, 1, NULL, '510700', '李白（701 年—762 年）是‌中国唐代伟大的浪漫主义诗人‌，字太白，号青莲居士，被后世尊称为“诗仙”。他的诗歌豪放飘逸、想象丰富，代表了盛唐气象，是中国古典文学的高峰之一。', 2, 2, '2026-10-08 19:40:12', '2026-10-08 19:40:12'),
	(6, '子瞻', '苏轼', 1, NULL, '', 'sushi@ruilink.top', NULL, NULL, '竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。', NULL, 1, NULL, '511400', '苏轼（1037年—1101年），字子瞻，号东坡居士，世称苏东坡。眉州眉山（今四川省眉山市）人，北宋文学家，书法家、画家。', 2, 2, '2026-10-08 19:42:38', '2026-10-08 19:42:38');

-- 正在导出表  inkwash.sys_user_group 的数据：~6 rows (大约)
INSERT INTO `sys_user_group` (`user_id`, `group_id`) VALUES
	(3, 3),
	(4, 3),
	(5, 4),
	(6, 4);
